# SQL Order and Limit

### Introduction

In the last section, we saw how to use the WHERE clause to specify which data to select.  We can think of the WHERE clause as loading up data into memory.  But once we specified which data to be loaded into memory with the WHERE clause, we can go further by ordering that data or limiting the number of rows returned from the selected data.  We do this with the `ORDER BY` and `LIMIT` clauses, where `ORDER BY` orders our rows, and `LIMIT` limits the number of rows returned from the selected data.

### Setting up our Data

In [1]:
import sqlite3
conn = sqlite3.connect('mean_green.db')
cursor = conn.cursor()

In [2]:
sql = """CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    phone_number TEXT, 
    zipcode TEXT,
    birthday TEXT
);"""

cursor.execute(sql)
conn.commit()

In [3]:
insert_data = """INSERT INTO employees (name, phone_number, zipcode, birthday) VALUES 
('fred', '555-333-4444', '10001', '8/17/1990'),
('bob', '555-331-4444', '10002', '3/22/1992'),
('sally', '555-332-4444', '10001', '6/22/1991');"""

cursor.execute(insert_data)

In [5]:
select_data = """Select * from Employees"""
cursor.execute(select_data)
cursor.fetchall()

[(1, 'fred', '555-333-4444', '10001', '8/17/1990'),
 (2, 'bob', '555-331-4444', '10002', '3/22/1992'),
 (3, 'sally', '555-332-4444', '10001', '6/22/1991')]

### Order By

Now that we have some data, let's work with the ORDER BY clause.  `ORDER BY` works as we would expect.  Here, let's order our list of employees by their name.

In [8]:
sql_select = """
SELECT * FROM employees ORDER BY name ASC
"""

cursor.execute(sql_select)
cursor.fetchall()

# [(None, 'bob', '555-331-4444', '10002', '3/22/1992'),
#  (None, 'fred', '555-333-4444', '10001', '8/17/1990'),
#  (None, 'sally', '555-332-4444', '10001', '6/22/1991')]

[(2, 'bob', '555-331-4444', '10002', '3/22/1992'),
 (1, 'fred', '555-333-4444', '10001', '8/17/1990'),
 (3, 'sally', '555-332-4444', '10001', '6/22/1991')]

We can see that we now have our employees listed alphabetically.  If you look at the SQL statement, it says, `ORDER BY name ASC`.  The `ASC` stands for ascending, which means move from lowest to highest.  If we want to go from highest to lowest, this would be `DESC` for descending.

At the end of our SQL statement, we simply specify the column that we wish to order by, and specify whether to order such that data as `ASC` -- smallest to biggest -- or `DESC`, biggest to smallest.

In [9]:
sql_select = """
SELECT * FROM employees ORDER BY name DESC
"""

cursor.execute(sql_select)
cursor.fetchall()

# [(None, 'sally', '555-332-4444', '10001', '6/22/1991'),
#  (None, 'fred', '555-333-4444', '10001', '8/17/1990'),
#  (None, 'bob', '555-331-4444', '10002', '3/22/1992')]

[(3, 'sally', '555-332-4444', '10001', '6/22/1991'),
 (1, 'fred', '555-333-4444', '10001', '8/17/1990'),
 (2, 'bob', '555-331-4444', '10002', '3/22/1992')]

### Limit and Offset

1. Limit

The `LIMIT` clause allows us to specify a number of records to return.  Let's see it in action.

In [10]:
sql_select = """
SELECT * FROM employees LIMIT 1
"""

cursor.execute(sql_select)
cursor.fetchall()

# [(None, 'fred', '555-333-4444', '10001', '8/17/1990')]

[(1, 'fred', '555-333-4444', '10001', '8/17/1990')]

So here we started with a SELECT statement for all columns, and then said to only return one record.

If we want to return the record with the name that comes first alphabetically, we can combine ORDER BY and LIMIT.

In [11]:
sql_select = """
SELECT * FROM employees ORDER BY name ASC LIMIT 1
"""

cursor.execute(sql_select)
cursor.fetchall()

# [(None, 'bob', '555-331-4444', '10002', '3/22/1992')]

[(2, 'bob', '555-331-4444', '10002', '3/22/1992')]

2. Offset

Offset is a cousin to limit so to speak.  It tells us how many rows to skip.  For example, if we want to return only the second row instead of the first row, we can use offset.

In [12]:
sql_select = """
SELECT * FROM employees LIMIT 1 OFFSET 1
"""

cursor.execute(sql_select)
cursor.fetchall()

# [(None, 'bob', '555-331-4444', '10002', '3/22/1992')]

[(2, 'bob', '555-331-4444', '10002', '3/22/1992')]

Offset can only be used along if there is also a LIMIT clause.

### Order of Operations with SQL

Now what tends to get tricky about the WHERE, ORDER BY, and LIMIT clauses is determining the order that we must provide them in SQL query.  To understand this best, we need a solid foundation in SQL's order of operations under the hood.  

The clauses are executed and specified in the following order:

* `FROM`
* `WHERE` 
* `SELECT` 
* `ORDER BY`
* `OFFSET`
* `LIMIT`

So think of this order as SQL first loading data from our WHERE clause into memory, then ordering this data, and finally offsetting and limiting the data.  Note that while the order of these operations is maintained, any combination of these SQL clauses can be specified.  The only SQL clause that we must specify is SELECT.

### Summary

In this lesson, we learned about the ORDER BY and LIMIT clauses.  The ORDER BY orders our rows by the values in a column, and can be ordered ASC (lowest to highest) or DESC (highest to lowest).  The LIMIT clause allows us to LIMIT the number of rows.  And if we would like skip a given number of rows and then LIMIT, we can use `LIMIT number OFFSET number`.

Finally, it's important to keep track of the order of operations with SQL.  Other than OFFSET, the order of operations follows the order that the clauses appear in a sql statement.

In [13]:
sql_select = """
SELECT * FROM employees ORDER BY name DESC LIMIT 1 OFFSET 1
"""

cursor.execute(sql_select)
cursor.fetchall()

# [(None, 'fred', '555-333-4444', '10001', '8/17/1990')]

[(1, 'fred', '555-333-4444', '10001', '8/17/1990')]

So above we specify that we are reading all columns from the employees table.  Then we order the rows by name largest to smallest, skip the first row, and only return the second row, which is fred's row.